Autodesk.Revit.DB.DirectShapeReferencingOption
An enumerated type containing possible referencing options for DirectShapes.
Since:
2016
Since:
2016

Autodesk.Revit.DB.DirectShapeReferencingOption.Referenceable
The associated DirectShape may be dimensioned and/or otherwise referenced.

Autodesk.Revit.DB.DirectShapeReferencingOption.NotReferenceable
The associated DirectShape shall not be referenceable.